In [5]:
# 산술연산 문제1)
import pandas as pd
price = pd.Series([30000, 15000, 200000], index=['키보드', '마우스', '모니터'])
print(price)
discount_price = price * 0.9
print(discount_price)

키보드     30000
마우스     15000
모니터    200000
dtype: int64
키보드     27000.0
마우스     13500.0
모니터    180000.0
dtype: float64

In [17]:
# 문제2)
menu_price = pd.Series([5500, 15000, 12000], index=['햄버거', '피자', '파스타'])
# menu_price = pd.Series( {'햄버거': 5500,  
real_price = menu_price * 1.1
print(real_price)

햄버거     6050.0
피자     16500.0
파스타    13200.0
dtype: float64

In [11]:
price = pd.Series([30000, 15000, 200000], index=['키보드', '마우스', '모니터'])
amount = pd.Series([2, 3, 1], index=['키보드', '마우스', '모니터'])
money = price * amount
money

키보드     60000
마우스     45000
모니터    200000
dtype: int64

In [23]:
# 문제4
mid_test = pd.Series([80, 85, 78], index=['철수', '영희', '민수'])
fin_test = pd.Series({"철수": 90, "영희": 95, "민수": 88})
avg_score = (mid_test + fin_test)/2
avg_score
df = pd.DataFrame( [mid_test, fin_test, avg_score] , index=['중간','기말','평균'])
student = df.T
student

      중간    기말    평균
철수  80.0  90.0  85.0
영희  85.0  95.0  90.0
민수  78.0  88.0  83.0

In [29]:
# 문제5
price = pd.Series([30000, 15000, 20000], index = ['키보드', '마우스', '모니터']) 
dis_rate = pd.Series([10, 5, 20], index = ['키보드', '마우스', '모니터'])
cal1 = price.mul(dis_rate, fill_value=0)
cal2 = cal1.div(100.0, fill_value=0)
fin_price = price.sub(cal2, fill_value=0)
print(fin_price)
df = pd.DataFrame( [price, fin_price], index=['원가가격', '최종가격'] )
data=df.T
data

키보드    27000.0
마우스    14250.0
모니터    16000.0
dtype: float64

        원가가격     최종가격
키보드  30000.0  27000.0
마우스  15000.0  14250.0
모니터  20000.0  16000.0

In [35]:
# 64page
import pandas as pd
import seaborn as sns

titanic = sns.load_dataset('titanic')
type(titanic)

pandas.core.frame.DataFrame

In [36]:
# 데이터셋의 목록보기
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [47]:
t_age_fare = titanic.loc[0:21, ['age', 'fare']]
titanic.head()
titanic.tail()
titanic.loc[400:501, :]
addition = t_age_fare + 10
print(t_age_fare)
print(addition)

     age     fare
0   22.0   7.2500
1   38.0  71.2833
2   26.0   7.9250
3   35.0  53.1000
4   35.0   8.0500
5    NaN   8.4583
6   54.0  51.8625
7    2.0  21.0750
8   27.0  11.1333
9   14.0  30.0708
10   4.0  16.7000
11  58.0  26.5500
12  20.0   8.0500
13  39.0  31.2750
14  14.0   7.8542
15  55.0  16.0000
16   2.0  29.1250
17   NaN  13.0000
18  31.0  18.0000
19   NaN   7.2250
20  35.0  26.0000
21  34.0  13.0000
     age     fare
0   32.0  17.2500
1   48.0  81.2833
2   36.0  17.9250
3   45.0  63.1000
4   45.0  18.0500
5    NaN  18.4583
6   64.0  61.8625
7   12.0  31.0750
8   37.0  21.1333
9   24.0  40.0708
10  14.0  26.7000
11  68.0  36.5500
12  30.0  18.0500
13  49.0  41.2750
14  24.0  17.8542
15  65.0  26.0000
16  12.0  39.1250
17   NaN  23.0000
18  41.0  28.0000
19   NaN  17.2250
20  45.0  36.0000
21  44.0  23.0000

In [62]:
# 그림 1-19 코드 하기
import numpy as np
df1 = pd.DataFrame( {"열A":[15,20,50,np.nan,np.nan], 
                     "열B":[100,500,200,500,200], 
                     "열c":[1,2,3,2,3] },
                    index=['행0','행1','행2','행3','행4'] )
df1
df2 = pd.DataFrame( {"열A":[10,10,10,20,30], 
                     "열B":[200,100,200,100,100] }, 
                    index=['행0','행1','행2','행3','행4'] )
df3 = df1.add(df2, fill_value=0)
df3

      열A   열B   열c
행0  25.0  300  1.0
행1  30.0  600  2.0
행2  60.0  400  3.0
행3  20.0  600  2.0
행4  30.0  300  3.0

In [92]:
# 69page  관계연산자 (> < == !=), 논리연산자 (&-그리고, |-또는  ~-반대) 
# 행1 열A 30.0 추출하기
df3.loc[ '행1','열A' ] != 30 
titanic = sns.load_dataset('titanic')
titanic.head()
df = titanic.loc[ 0:9, ['age','fare'] ]
df['age']
df['age'] < 20
# True값이 레코드가 추출된다.
df[ df['age'] < 20 ]
df[ df.age < 20 ]

df[ ~(df.age < 20) ]

# 나이가 20대인 승객 출력  (age >= 20) & (age <= 29)
df[  (df.age >= 20) & (df.age <= 29) ] 

# 나이가 20세 미만이고 여성인 승객 sex  female
titanic.head()
df_age_sex = titanic.loc[0:9, ['age', 'sex']]
df_age_sex[(df_age_sex.age < 20) & (df_age_sex.sex == 'female')]
# 나이가 20세 미만이거나 여성인 승객 sex  female
df_age_sex[(df_age_sex.age < 20) | (df_age_sex.sex == 'female')]
# 조건은 mask 변수로 처리 참인 행을 여러 열(열의 목록 나열) 추출
mask = (titanic.age < 10) | (titanic.age > 60)
titanic.loc[ mask, ['age','sex', 'alone' ] ]

       age     sex  alone
7     2.00    male  False
10    4.00  female  False
16    2.00    male  False
24    8.00  female  False
33   66.00    male   True
..     ...     ...    ...
831   0.83    male  False
850   4.00    male  False
851  74.00    male   True
852   9.00  female  False
869   4.00    male  False

[84 rows x 3 columns]

In [119]:
# 문제6 데이터프레임 연산 문제
df =pd.DataFrame( {'상품명': ['키보드','마우스','모니터'], 
               '2023년 가격(원)':[30000,15000, 200000] , 
               '2024년 가격(원)':[33000, 16500, 220000] } )
df = df.set_index('상품명')
df['예상가격'] = df['2024년 가격(원)'] * 1.05
df

     2023년 가격(원)  2024년 가격(원)      예상가격
상품명
키보드        30000        33000   34650.0
마우스        15000        16500   17325.0
모니터       200000       220000  231000.0

In [120]:
# 문제7 데이터프레임과 데이터프레임 연산하는 문제
df_1 = pd.DataFrame( {'상품명': ['키보드','마우스','모니터'], 
               '매출액':[60000,45000, 1200000] } )
df_2 = pd.DataFrame( {'상품명': ['키보드','마우스','모니터'], 
               '매출액':[72000,51000, 1500000] } )
df_1=df_1.set_index('상품명')
df_2=df_2.set_index('상품명')
df_increase = df_2 - df_1
df_increase

        매출액
상품명
키보드   12000
마우스    6000
모니터  300000

In [129]:
# 문제8 필터링에서 불린 인덱싱 문제
df =pd.DataFrame( {'상품명': ['키보드','마우스','모니터', '헤드셋','웹캠'], 
               '매출액(원)':[300000,500000, 1500000, 80000, 120000] } )
#df[ '매출액'] 
df.매출액 >= 1000000
mask = df[ '매출액']  >= 1000000
mask
# df[ mask ]['매출액']
df[mask]

   상품명      매출액
2  모니터  1500000

In [132]:
# 문제9
df = pd.DataFrame({'이름':['김철수', '이영희', '박민수', '정수현', '송지혜'], '나이':[25, 32, 40, 28, 35]})
df = df.set_index('이름')
mask = df.나이 >= 30
df.loc[mask, '나이']
df[mask]['나이']

이름
이영희    32
박민수    40
송지혜    35
Name: 나이, dtype: int64

In [173]:
# 75page query()
# 예제 1-28
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
df = titanic.loc[0:9, ['age', 'fare']]
df.query( 'age < 20' )
titanic.head()
titanic.query( 'pclass == 1' )
titanic.query( "(who == 'woman')  &  (deck == 'C')")

pd.set_option('display.max_columns', 15)
pd.get_option('display.max_columns')
pd.reset_option('display.max_columns') # set_option한 것을 초기화하기 
mask1 = titanic['embark_town'] == 'Southampton'
mask1
titanic
mask2 = titanic['embark_town'] == 'Queenstown'
mask2
df_boolean = titanic[mask1 | mask2]
df_boolean

isin_filters = titanic['embark_town'].isin( ['Southampton', 'Queenstown'] )
titanic[ isin_filters ]

isin_filters = titanic['embark_town'].isin( ['Southampton', 'Queenstown'] )
titanic[ isin_filters ]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [185]:
# 문제10
df = pd.DataFrame( {'상품명': ['키보드','마우스','모니터', '헤드셋','웹캠'], 
                   '가격(원)':[30000, 500000, 1500000, 80000, 120000] } )
df=df.rename( columns = {'가격(원)': '가격'} )
# df = df.rename(columns={'A': 'Alpha', 'B': 'Beta'})
df.query( '가격 >= 30000 and 가격 <= 100000' )

   상품명     가격
0  키보드  30000
3  헤드셋  80000

In [181]:
# 문제11
df = pd.DataFrame({'상품명': ['키보드', '마우스', '모니터', '헤드셋', '웹캠', '이어폰'],
                   '가격(원)': [300000, 500000, 1500000, 80000, 120000, 25000]})
mask = df['상품명'].isin(['키보드', '마우스', '웹캠'])
df[mask]

   상품명   가격(원)
0  키보드  300000
1  마우스  500000
4   웹캠  120000

In [195]:
# 79page
import pandas as pd
import numpy as np
# object dtype
df1 = pd.DataFrame({'이름': ['철수', '영희', np.nan]}, dtype='object')
# , dtype='object' 생략할 수 있다.
print(df1['이름'].dtype)  # object
print( df1 )
# StringDtype
df2 = pd.DataFrame({'이름': ['철수', '영희', pd.NA]}, dtype='string')
print(df2['이름'].dtype)  # string[python]
print( df2 )

print( df1['이름'].isna() )
print( df2['이름'].isna() )

import numpy as np
df2['이름'].isna()

object
     이름
0    철수
1    영희
2  None
string
     이름
0    철수
1    영희
2  <NA>
0    False
1    False
2     True
Name: 이름, dtype: bool
0    False
1    False
2     True
Name: 이름, dtype: bool

In [205]:
#  
fruit_names = pd.Series(['Apple', 'Banana', 'Cherry'])
fruit_names # dtype - 각 원소의 자료형 data의 자료형 
# type( fruit_names ) - 자료형
fruit_names = pd.Series(['Apple', 'Banana', 'Cherry'], dtype='string')
fruit_names
fruit_names = pd.Series(['Apple', 'Banana', 'Cherry'], dtype=pd.StringDtype())
fruit_names
fruit_names = pd.Series(['Apple', 'Banana', 'Cherry'])
fruit_names # dtype - 각 원소의 자료형 data의 자료형
# object로 만들어진 문자에 문자열 메소드를 적용하고 싶다면 어떻게? dtype을 바꾸기 -astype()
fruit_names = fruit_names.astype('string')
fruit_names
fruit_names = fruit_names.astype('object')
fruit_names

0     Apple
1    Banana
2    Cherry
dtype: object

In [251]:
import pandas as pd
import numpy as np
# 교재 82page 코드 딕셔너리형태 시리즈 만들기
ser_obj = pd.Series({"First": 'Apple_사과_500',
                "Second": 'Banana_바나나_300',
                "Third": 'Cherry_체리_1000',
                "Fourth": np.nan})
ser_obj
ser_str = pd.Series({"First": 'Apple,사과,500',
                "Second": 'Banana,바나나,300',
                "Third": 'Cherry,체리,1000',
                "Fourth": np.nan}, dtype="string")
ser_str
# 소문자 변환
ser_obj.str.lower()
ser_str.str.lower()
ser_obj.str.upper()
ser_str.str.upper()
a = ser_str.str.split(',')
s1 = pd.Series({'c0': 'A:10-20-30',
                'c1': 'B:20-50-40'}, dtype="string")
#  [A, 10, 20, 30]  [B, 20, 50, 40]
a1 = s1.str.split(':') # a = a.str.split('[:\-]')
print(a1)
aa1 = a1[0][1]
print(type(aa1), "@@@" )
a_10_20_30 = aa1.split('-')
print(a_10_20_30, "####")
a_answer =list(a1[0][0]) #['A'] + ['10','20','30']
a_answer = a_answer + a_10_20_30
a_answer

aa2 = a1[1][1]
print(type(aa2), "@@@")
a_10_20_30 = aa2.split('-')
print(a_10_20_30, "####")
a_answer = list(a1[1][0]) #['A'] + ['10','20','30']
a_answer = a_answer + a_10_20_30
a_answer

s2 = pd.Series({'c0': 'A:10-20,20-30,40-50',
                'c1': 'B:20-50,10-40,60-20'}, dtype="string")
s2_a = s2.str.split('[:\,\-]')
s2_a

c0    [A, 10-20-30]
c1    [B, 20-50-40]
dtype: object
<class 'str'> @@@
['10', '20', '30'] ####
<class 'str'> @@@
['20', '50', '40'] ####

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_19852\824630456.py:25: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  aa1 = a1[0][1]
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_19852\824630456.py:29: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  a_answer =list(a1[0][0]) #['A'] + ['10','20','30']
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_19852\824630456.py:33: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  aa2 = a1[1][1]
C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_19852\824630456.py:37: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  a_answer = list(a1[1][0]) #['A'] + ['10','20','30']

c0    [A, 10, 20, 20, 30, 40, 50]
c1    [B, 20, 50, 10, 40, 60, 20]
dtype: object

In [295]:
ser_obj = pd.Series({"First": 'Apple_사과_500',
                "Second": 'Banana_바나나_300',
                "Third": 'Cherry_체리_1000',
                "Fourth": np.nan})
ser_obj
ser_str = pd.Series({"First": '  Apple_사과_  500   ',
                "Second": '   Banana_  바나나_300   ',
                "Third": '   Cherr  y_체리_1000  ',
                "Fourth": np.nan}, dtype="string")

# ser_str.values
for i in ser_str.values:
    print( i.strip() )

'''
ser_str
s1 = ser_str.str.split('_', expand=True) #결과값이 데이터프레임으로 나옴
type(s1)
s2 = ser_str.str.split('_', expand=False) #결과값이 시리즈로 나옴 
type(s2)
s2
s1
s3 = ser_str.str.split('_') #결과값이 시리즈로 나옴 
type(s3)
s3
idx = s3.index
idx
vals = s3.values
vals

s4 = ser_str.str.strip() #공백제거
'  a  '.rstrip()
'''

Apple_사과_  500
Banana_  바나나_300
Cherr  y_체리_1000

AttributeError: 'NAType' object has no attribute 'strip'

In [316]:
import pandas as pd
import numpy as np

ser_str = pd.Series({'First':'Apple_사과  _500',
                 'Second':'Banana_바나나      _300',
                 'Third':'Cherry_체리   _1000',
                 'Fourth':np.nan})

ser_str
s3 = ser_str.str.split('_') # expand = 디폴트는 Series
s3
#s3.str.strip()
s_r = ser_str.str.replace("_", ":", regex=False)
print(s_r)
s_r_r = ser_str.str.replace("[^a-zA-Z0-9]", "", regex=True)
s_r_r

print( ser_str )
ser_str.str[0:5]
ser_str.str.contains("e", na=False)

ser_str.str.contains(r"[A|B][a-z]+")
ser_str.str.fullmatch("Apple:사과  :500")

First           Apple:사과  :500
Second    Banana:바나나      :300
Third        Cherry:체리   :1000
Fourth                     NaN
dtype: object
First           Apple_사과  _500
Second    Banana_바나나      _300
Third        Cherry_체리   _1000
Fourth                     NaN
dtype: object

First     False
Second    False
Third     False
Fourth      NaN
dtype: object

In [1]:
# 문자열 메소드
# 교재 82페이지
import pandas as pd
import numpy as np
ser = pd.Series( ['Apple_사과', 'Banana_바나나','Cherry_체리', np.nan],
                 index=["Fruit: ", " Second", "Third", "Fourth"] )
print(ser) # object 객체 파이썬 문자열 형태
print("\n")
ser2 = pd.Series( ['Apple_사과', 'Banana_바나나','Cherry_체리', np.nan],
                 index=["Fruit: ", " Second", "Third", "Fourth"],
                 dtype="string")
print(ser2) # string 판다스 문자열 형태  - 장점 : 판다스 처리할 때 효율적

Fruit:       Apple_사과
 Second    Banana_바나나
Third       Cherry_체리
Fourth            NaN
dtype: object


Fruit:       Apple_사과
 Second    Banana_바나나
Third       Cherry_체리
Fourth           <NA>
dtype: string

In [5]:
print(ser.str.lower())
print(ser.str.upper())
print(ser.str.len())

Fruit:       apple_사과
 Second    banana_바나나
Third       cherry_체리
Fourth            NaN
dtype: object
Fruit:       APPLE_사과
 Second    BANANA_바나나
Third       CHERRY_체리
Fourth            NaN
dtype: object
Fruit:      8.0
 Second    10.0
Third       9.0
Fourth      NaN
dtype: float64

In [18]:
#print(ser.str.split("_"))
df=ser.str.split("_", expand=True)
df
get_1 = ser.str.split("_").str.get(0)
#print("\n")
#print(get_1)
# ex) a-10-b,a1-20-b2 시리즈로 만들기 index=['c0','c1'], 자료형은 string
ser1 = pd.Series( ['a:a10-10-b','b:a1-20-b2'], index=['c0','c1'], dtype="string" )
#print( ser1 )
# "-" 문자를 기준으로 분리하기
ser1_s = ser1.str.split("-").str.get(1)
print(ser1_s)
# ":", "-"문자를 기준으로 분리하기
ser1_2_s = ser1.str.split("[:\-]")
print(ser1_2_s)

c0    10
c1    20
dtype: object
c0    [a, a10, 10, b]
c1    [b, a1, 20, b2]
dtype: object

In [26]:
idx = ser.index
idx
idx.str.strip()
idx.str.lstrip()
idx.str.rstrip()

Index(['Fruit:', ' Second', 'Third', 'Fourth'], dtype='object')

In [32]:
# 정규표현식 : 문자열의 패턴을 코드해서 패턴에 맞는 것 검색하기
ser=ser.str.replace("_", ",", regex=False)

Fruit:       Apple,사과
 Second    Banana,바나나
Third       Cherry,체리
Fourth            NaN
dtype: object

In [34]:
ser=ser.str.replace(",", "-", regex=False) 
ser

Fruit:       Apple-사과
 Second    Banana-바나나
Third       Cherry-체리
Fourth            NaN
dtype: object

In [38]:
ser.str.replace("[^a-zA-Z\s]", "", regex=True) 
# 영문자 소문자 대문자 공백을 제외하고 모든 문자열을 "" 지우기 바꾸기
# 한글
ser.str.replace("[a-zA-Z\-]", "", regex=True)
ser.str.replace("[^가-힣]", "", regex=True)

Fruit:      사과
 Second    바나나
Third       체리
Fourth     NaN
dtype: object

In [44]:
ser
ser.str[-1:-3:-1]

Fruit:      과사
 Second     나나
Third       리체
Fourth     NaN
dtype: object

In [71]:
ser = pd.Series( ['Apple_사과', 'Banana_바나나','A', np.nan],
                 index=["Fruit: ", " Second", "Third", "Fourth"] )
ser.str.contains("A", na=False) # ser안에 "A"문자가 있는지 검색 
ser.str.contains(r"[A|C][a-z]+") # r-정규표현식 regex, [A|B] - 첫글자가 A 또는 B [a-z]두번째글자가 소문자, + 하나이상

Fruit:      True
 Second    False
Third      False
Fourth       NaN
dtype: object

In [68]:
import re
pattern = r"[A|C][a-z]"
test_string = [ "Apple", "Cat","hello", "Bat", "A" ]
for s in test_string:
    match = re.match( pattern, s )
    print(match)

<re.Match object; span=(0, 2), match='Ap'>
<re.Match object; span=(0, 2), match='Ca'>
None
None
None

In [90]:
# 
ser3=pd.Series(['a1', 'b2', 'c3', 'd4e5f9', 'e6f7', 'f8' ], dtype="string" )
# 숫자 추출하기
digits = ser3.str.extractall(r"(\d)").groupby(level=0).agg(''.join)
digits
# 영문자 소문자 추출하기
letters = ser3.str.extractall(r"([a-z])").groupby(level=0).agg(''.join)
letters
# 대문자 추출하기
ser4 = pd.Series(['A1', 'B2', 'C3', 'D4E5F9', 'E6F7', 'F8' ], dtype="string")
A_letters = ser4.str.extractall(r"([A-Z])").groupby(level=0).agg(''.join)
A_letters
# 한글 추출하기
ser5 = pd.Series(['가1', '나2', '다3', '라4마5바9', '바6사7', '사8' ], dtype="string")
h_letters = ser5.str.extractall(r"([가-힣])").groupby(level=0).agg(''.join)
h_letters
# 숫자와 문자를 따로 분리해서
split_columns = ser3.str.extract(r"(?P<문자>[a-z]+)(?P<숫자>\d+)")
# ?P<name> - 열의 이름을 할당하는 코드
print(split_columns)

split_columns = ser3.str.extractall(r"(?P<Letter>[a-z]+)(?P<Digit>\d+)").groupby(level=0).agg("".join)
split_columns

  문자 숫자
0  a  1
1  b  2
2  c  3
3  d  4
4  e  6
5  f  8

  Letter Digit
0      a     1
1      b     2
2      c     3
3    def   459
4     ef    67
5      f     8